Revit 2026 API

# VertexStreamPositionNormalAddVertices Method

---
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddVertices(
	IList<VertexPositionNormal> vertices
)
```
```vb
Public Sub AddVertices (
	vertices As IList(Of VertexPositionNormal)
)
```
```cpp
public:
void AddVertices(
	IList<VertexPositionNormal^>^ vertices
)
```
```fsharp
member AddVertices :
        vertices : IList<VertexPositionNormal> -> unit
```

#### Parameters

vertices IListVertexPositionNormal

#### Reference

VertexStreamPositionNormal Class

Autodesk.Revit.DB.DirectContext3D Namespace